# Merge 
```
Often Dataframes are not in the exact same order or format , meaning we can not simply concatenate them together .

In this case , we need to merge the DataFrames 

This is analogous to a JOIN command in SQl 

pd.merge()

how = Inner , outer , left & right 

```

In [1]:
import numpy as np 
import pandas as pd

In [13]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})

logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [14]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [15]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [16]:
#help(pd.merge)

In [17]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

# Left and Right Merge

In [18]:
pd.merge(registrations,logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [19]:
pd.merge(logins,registrations,how='left',on='name')

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4     Bobo     2.0

In [20]:
pd.merge(registrations,logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [22]:
pd.merge(registrations,logins,how='right')

# but better to specify the join columns

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

# Outer Merge

In [23]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [24]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [27]:
pd.merge(registrations,logins,how='outer',on='name')  # order does not matter

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [28]:
pd.merge(logins,registrations,how='outer',on='name') # order does not matter

   log_id     name  reg_id
0     2.0   Andrew     1.0
1     4.0     Bobo     2.0
2     NaN   Claire     3.0
3     NaN    David     4.0
4     1.0   Xavier     NaN
5     3.0  Yolanda     NaN

In [29]:
registrations=registrations.set_index('name')

In [30]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [32]:
pd.merge(registrations,logins,left_index=True,right_on='name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [33]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [35]:
registrations = registrations.reset_index()
registrations

   index    name  reg_id
0      0  Andrew       1
1      1    Bobo       2
2      2  Claire       3
3      3   David       4

In [38]:
registrations.columns = ['index','reg_name','reg_id']
registrations

   index reg_name  reg_id
0      0   Andrew       1
1      1     Bobo       2
2      2   Claire       3
3      3    David       4

In [39]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [41]:
results = pd.merge(registrations,logins,how='inner',left_on='reg_name',right_on='name')
results.drop('reg_name',axis=1) # remove duplicate cols 
results

   index reg_name  reg_id  log_id    name
0      0   Andrew       1       2  Andrew
1      1     Bobo       2       4    Bobo

In [45]:
registrations.columns = ['index','name','id']
registrations

   index    name  id
0      0  Andrew   1
1      1    Bobo   2
2      2  Claire   3
3      3   David   4

In [46]:
logins.columns = ['id','name']

In [50]:
pd.merge(registrations,logins,how='inner',on='name',suffixes=('_reg','_log'))

# pandas automatically tags the duplicate tables even if suffixex not given

   index    name  id_reg  id_log
0      0  Andrew       1       2
1      1    Bobo       2       4